# Pandas

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.5.3'

In [4]:
data = {
    'a': [10,20,30,40],
    'b': ['xx','yy','zz','qq'],
    'c': [1.5,2.6,3.7,4.8]
}
df1  = pd.DataFrame(data)
df1

    a   b    c
0  10  xx  1.5
1  20  yy  2.6
2  30  zz  3.7
3  40  qq  4.8

In [5]:
type(df1)

pandas.core.frame.DataFrame

In [6]:
df1.columns

Index(['a', 'b', 'c'], dtype='object')

In [7]:
for x in df1:
    print(x)

a
b
c

In [8]:
# number of rows
len(df1)

4

In [9]:
# number of columns
len(df1.columns)

3

In [11]:
df1.shape

(4, 3)

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      int64
 1   b       4 non-null      object
 2   c       4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [13]:
df1.describe()

               a         c
count   4.000000  4.000000
mean   25.000000  3.150000
std    12.909944  1.420094
min    10.000000  1.500000
25%    17.500000  2.325000
50%    25.000000  3.150000
75%    32.500000  3.975000
max    40.000000  4.800000

In [14]:
data = [
    {'a': 10, 'b': 'Joe', 'c': 1.5},
    {'a': 20, 'c': 1.5},
    {'a': 30, 'b': 'Tom', 'c': 2.5},
    {'a': 40, 'b': 'George', 'c': 5.5}
]
df2 = pd.DataFrame(data)
df2

    a       b    c
0  10     Joe  1.5
1  20     NaN  1.5
2  30     Tom  2.5
3  40  George  5.5

In [16]:
import numpy as np
np.nan == np.nan

False

In [17]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
pd.DataFrame(data, index = ['xx','yy','zz','zzz'])

      a       b    c
xx   10     Joe  1.5
yy   20     NaN  1.5
zz   30     Tom  2.5
zzz  40  George  5.5

In [20]:
se1 = pd.Series([20,30,40])
se1

0    20
1    30
2    40
dtype: int64

In [21]:
type(se1)

pandas.core.series.Series

In [22]:
pd.Series([20,30,40], index=['a','b','c'])

a    20
b    30
c    40
dtype: int64

In [23]:
df1

    a   b    c
0  10  xx  1.5
1  20  yy  2.6
2  30  zz  3.7
3  40  qq  4.8

In [24]:
df1['a']

0    10
1    20
2    30
3    40
Name: a, dtype: int64

In [25]:
df1.a

0    10
1    20
2    30
3    40
Name: a, dtype: int64

In [26]:
df1[['a','b']]

    a   b
0  10  xx
1  20  yy
2  30  zz
3  40  qq

In [27]:
# Series
df1[['a']]

    a
0  10
1  20
2  30
3  40

In [28]:
data = [
    {'a': 10, 'b': 'Joe', 'c': 1.5},
    {'a': 20, 'c': 1.5},
    {'a': 30, 'b': 'Tom', 'c': 2.5},
    {'a': 40, 'b': 'George', 'c': 5.5}
]
df3 = pd.DataFrame(data, index=['ww', 'xx', 'yy', 'zz'])
df3

     a       b    c
ww  10     Joe  1.5
xx  20     NaN  1.5
yy  30     Tom  2.5
zz  40  George  5.5

In [30]:
df3.loc['xx']

a     20
b    NaN
c    1.5
Name: xx, dtype: object

In [32]:
df3.iloc[0]

a     10
b    Joe
c    1.5
Name: ww, dtype: object

In [33]:
df3[:2]

     a    b    c
ww  10  Joe  1.5
xx  20  NaN  1.5

In [34]:
se2 = pd.Series([20,30,40], index=['a','b','c'])
se2

a    20
b    30
c    40
dtype: int64

In [35]:
se2['b']

30

In [36]:
se2.values

array([20, 30, 40])

In [37]:
df1.values

array([[10, 'xx', 1.5],
       [20, 'yy', 2.6],
       [30, 'zz', 3.7],
       [40, 'qq', 4.8]], dtype=object)

# Selection

In [38]:
df=pd.DataFrame([
    {'student': 'John Doe', 'subject': 'Mathimatics', 'grade': 5},
    {'student': 'John Doe', 'subject': 'History', 'grade': 2},
    {'student': 'Jana Smith', 'subject': 'Mathimatics', 'grade': 3},
    {'student': 'Jana Smith', 'subject': 'Mathimatics', 'grade': 5},
    {'student': 'Jana Smith', 'subject': 'History', 'grade': 4},
    {'student': 'Scunner Campbell', 'subject': 'Mathimatics', 'grade': 1},
    {'student': 'Scunner Campbell', 'subject': 'Mathimatics', 'grade': 2},
    {'student': 'Scunner Campbell', 'subject': 'History', 'grade': 5},
])
df

            student      subject  grade
0          John Doe  Mathimatics      5
1          John Doe      History      2
2        Jana Smith  Mathimatics      3
3        Jana Smith  Mathimatics      5
4        Jana Smith      History      4
5  Scunner Campbell  Mathimatics      1
6  Scunner Campbell  Mathimatics      2
7  Scunner Campbell      History      5

In [39]:
df['student'] == 'John Doe'

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
Name: student, dtype: bool

In [40]:
df[df['student'] == 'John Doe']

    student      subject  grade
0  John Doe  Mathimatics      5
1  John Doe      History      2

In [46]:
df[(df['grade']>1) & (df['grade']<5)]

            student      subject  grade
1          John Doe      History      2
2        Jana Smith  Mathimatics      3
4        Jana Smith      History      4
6  Scunner Campbell  Mathimatics      2

# Groupby

In [47]:
df

            student      subject  grade
0          John Doe  Mathimatics      5
1          John Doe      History      2
2        Jana Smith  Mathimatics      3
3        Jana Smith  Mathimatics      5
4        Jana Smith      History      4
5  Scunner Campbell  Mathimatics      1
6  Scunner Campbell  Mathimatics      2
7  Scunner Campbell      History      5

In [49]:
gb = df.groupby('subject')
gb

In [50]:
type(gb)

pandas.core.groupby.generic.DataFrameGroupBy

In [51]:
gb.size()

subject
History        3
Mathimatics    5
dtype: int64

In [52]:
df.groupby('subject').size()

subject
History        3
Mathimatics    5
dtype: int64

In [53]:
df.groupby('subject')['grade'].mean()

subject
History        3.666667
Mathimatics    3.200000
Name: grade, dtype: float64

In [54]:
df.groupby(['student','subject'])['grade'].mean()

student           subject
Jana Smith        History        4.0
                  Mathimatics    4.0
John Doe          History        2.0
                  Mathimatics    5.0
Scunner Campbell  History        5.0
                  Mathimatics    1.5
Name: grade, dtype: float64

# Ex

In [55]:
names = ['roun','hteam','ateam','hgoals','agoals']
df = pd.read_csv('pl.txt', sep='\t', skiprows=6, names=names)
df

     round                 hteam                    ateam  hgoals  agoals
0        1      Blackburn Rovers  Wolverhampton Wanderers       1       2
1        1             Fulham FC              Aston Villa       0       0
2        1          Liverpool FC           Sunderland AFC       1       1
3        1   Queens Park Rangers         Bolton Wanderers       0       4
4        1        Wigan Athletic             Norwich City       1       1
..     ...                   ...                      ...     ...     ...
375     38        Sunderland AFC        Manchester United       0       1
376     38          Swansea City             Liverpool FC       1       0
377     38     Tottenham Hotspur                Fulham FC       2       0
378     38  West Bromwich Albion               Arsenal FC       2       3
379     38        Wigan Athletic  Wolverhampton Wanderers       3       2

[380 rows x 5 columns]

In [56]:
pd.read_csv?

In [57]:
df['goals']=df['hgoals']+df['agoals']

In [58]:
df

,round,hteam,ateam,hgoals,agoals,goals
0,1,Blackburn Rovers,Wolverhampton Wanderers,1,2,3
1,1,Fulham FC,Aston Villa,0,0,0
2,1,Liverpool FC,Sunderland AFC,1,1,2
3,1,Queens Park Rangers,Bolton Wanderers,0,4,4
4,1,Wigan Athletic,Norwich City,1,1,2
...,...,...,...,...,...,...
375,38,Sunderland AFC,Manchester United,0,1,1
376,38,Swansea City,Liverpool FC,1,0,1
377,38,Tottenham Hotspur,Fulham FC,2,0,2
378,38,West Bromwich Albion,Arsenal FC,2,3,5
379,38,Wigan Athletic,Wolverhampton Wanderers,3,2,5

In [59]:
df[df['round'] == 13]['goals'].sum()

25

In [60]:
se = df.groupby('round')['goals'].sum()
se

round
1     20
2     23
3     31
4     22
5     38
6     27
7     34
8     32
9     31
10    39
11    31
12    30
13    25
14    30
15    30
16    18
17    31
18    19
19    26
20    29
21    22
22    35
23    23
24    31
25    36
26    30
27    24
28    17
29    27
30    25
31    35
32    23
33    29
34    28
35    22
36    35
37    26
38    32
Name: goals, dtype: int64

In [62]:
se.idxmax(), se.max()

(10, 39)

In [63]:
df.groupby('round').size()

round
1     10
2     10
3     10
4     10
5     10
6     10
7     10
8     10
9     10
10    10
11    10
12    10
13    10
14    10
15    10
16    10
17    10
18    10
19    10
20    10
21    10
22    10
23    10
24    10
25    10
26    10
27    10
28    10
29    10
30    10
31    10
32    10
33    10
34    10
35    10
36    10
37    10
38    10
dtype: int64

In [65]:
df.groupby('round')['goals'].sum().sort_values(ascending=False)[:10]

round
10    39
5     38
25    36
22    35
36    35
31    35
7     34
38    32
8     32
9     31
Name: goals, dtype: int64

In [78]:
len(df[df['goals']>0])/len(df)*100

92.89473684210526

In [81]:
# second way
(df['goals']>0).mean()*100

92.89473684210526

# Ex

In [82]:
df = pd.read_csv('volcanoes_2021.csv')

In [83]:
df

,Region,Number,Volcano Name,Country,Location,Latitude,Longitude,Elevation (m),Type,Status,Last Known Eruption
0,West Indies,1600-21-,Piparo,Trinidad,Trinidad,10.000,-61.000,140.0,Mud volcano,Historical,D1
1,West Indies,1600-08=,"Diables, Morne aux",Dominica,W Indies,15.612,-61.430,861.0,Stratovolcano,Fumarolic,U
2,West Indies,1600-09=,"Diablotins, Morne",Dominica,W Indies,15.503,-61.397,1430.0,Stratovolcano,Holocene,U
3,West Indies,1600-11=,"Plat Pays, Morne",Dominica,W Indies,15.255,-61.341,940.0,Stratovolcano,Radiocarbon,D5
4,West Indies,1600-10=,"Trois Pitons, Morne",Dominica,W Indies,15.370,-61.330,1387.0,Lava dome,Historical,D3
...,...,...,...,...,...,...,...,...,...,...,...
1566,Melanesia and Australia,0507-08-,NE Shepherd Islands,Vanuatu,Vanuatu-SW Pacific,-16.992,168.592,216.0,Stratovolcano,Holocene,Unknown
1567,Melanesia and Australia,0507-081,North Vate,Vanuatu,Vanuatu-SW Pacific,-17.470,168.353,594.0,Stratovolcano,Holocene,U
1568,Melanesia and Australia,0507-01=,Suretamatai,Vanuatu,Vanuatu-SW Pacific,-13.800,167.470,921.0,Complex volcano,Historical,D1
1569,Melanesia and Australia,0507-09=,Traitor's Head,Vanuatu,Vanuatu-SW Pacific,-18.754,169.238,817.0,Stratovolcano,Historical,D3
1570,Melanesia and Australia,0507-10=,Yasur,Vanuatu,Vanuatu-SW Pacific,-19.532,169.447,361.0,Stratovolcano,Historical,D1

In [85]:
# 1
df.columns

Index(['Region', 'Number', 'Volcano Name', 'Country', 'Location', 'Latitude',
       'Longitude', 'Elevation (m)', 'Type', 'Status', 'Last Known Eruption'],
      dtype='object')

In [ ]:
# 2

In [86]:
len(df.columns)

11

In [87]:
# 3
len(df)

1571

In [88]:
# 4 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1571 entries, 0 to 1570
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Region               1571 non-null   object
 1   Number               1571 non-null   object
 2   Volcano Name         1571 non-null   object
 3   Country              1571 non-null   object
 4   Location             1571 non-null   object
 5   Latitude             1571 non-null   float64
 6   Longitude            1571 non-null   float64
 7   Elevation (m)        1566 non-null   float64
 8   Type                 1571 non-null   object
 9   Status               1571 non-null   object
 10  Last Known Eruption  1571 non-null   object
dtypes: float64(3), object(8)
memory usage: 135.1+ KB

In [90]:
# 5
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Latitude,1571.0,14.686419,31.940257,-78.50,-6.725,14.07,42.3900,88.27
Longitude,1571.0,23.415143,112.861177,-179.97,-78.162,38.12,137.5705,179.58
Elevation (m),1566.0,1624.821839,1630.288854,-6000.00,655.250,1448.50,2334.7500,6879.00

In [106]:
# 1
d = (df['Country']== 'India').sum()
d

2

In [118]:
# 2
g = df[(df['Country']== 'India')]['Latitude'].max()
v = df[((df['Latitude'] == g) & (df['Country']== 'India'))]
v['Volcano Name']

477    Narcondum
Name: Volcano Name, dtype: object

In [128]:
# 3
df['Country'].nunique()

95

In [129]:
df['Country'].unique()

array(['Trinidad', 'Dominica', 'Grenada', 'Guadeloupe', 'Martinique',
       'Montserrat', 'Netherlands', 'St. Kitts & Nevis', 'St. Lucia',
       'St. Vincent & the Grenadines', 'Congo, DRC', 'Rwanda', 'Uganda',
       'Kenya', 'Tanzania', 'Algeria', 'Chad', 'Libya', 'Mali', 'Sudan',
       'Djibouti', 'Eritrea', 'Ethiopia', 'Cameroon', 'Equatorial Guinea',
       'Nigeria', 'Sao Tome & Principe', 'Yemen', 'United States',
       'Antarctica', 'Atlantic Ocean', 'Bouvet I.', 'United Kingdom',
       'Portugal', 'Spain', 'Cape Verde', 'Canada', 'Pacific Ocean',
       'New Zealand', 'France', 'Arctic Ocean', 'Jan Mayen', 'Iceland',
       'India', 'Indonesia', 'Malaysia', 'Japan', 'China', 'Taiwan',
       'North Korea', 'Russia', 'South Korea', 'Mongolia', 'Argentina',
       'Bolivia', 'Chile', 'Colombia', 'Ecuador', 'Peru', 'Philippines',
       'Myanmar', 'Vietnam', 'Fiji', 'Tonga', 'American Samoa', 'Samoa',
       'Wallis & Futuna', 'Afghanistan', 'Indian Ocean', 'Saudi Arabia',
       'French Southern & Antarctic Lands', 'Heard I. & McDonald Is.',
       'South Africa', 'Comoros', 'Reunion', 'Iran', 'Madagascar',
       'Syria', 'Costa Rica', 'El Salvador', 'Guatemala', 'Honduras',
       'Mexico', 'Nicaragua', 'Panama', 'Armenia', 'Georgia', 'Germany',
       'Greece', 'Italy', 'Turkey', 'Papua New Guinea', 'Australia',
       'Solomon Is.', 'Vanuatu'], dtype=object)

In [130]:
# 4
df.groupby('Country').size().sort_values(ascending=False)[:5]

Country
United States    184
Russia           169
Indonesia        136
Japan            111
Chile             87
dtype: int64

In [131]:
# 5
df[df['Elevation (m)'] > 0]['Elevation (m)'].mean()

1908.3862508858965

# Ex

In [136]:
# 1
((df['Elevation (m)'] < 0) & (df['Latitude'] > 0)).sum() > ((df['Elevation (m)'] < 0) & (df['Latitude'] < 0)).sum()

True

In [146]:
# 2
df[df['Country'] == 'Chile'].groupby('Type').size().sort_values(ascending=False) / len(df[df['Country'] == 'Chile']) * 100

Type
Stratovolcano         65.517241
Cinder cone            6.896552
Caldera                5.747126
Pyroclastic cone       4.597701
Lava dome              3.448276
Maar                   2.298851
Pyroclastic cones      2.298851
Shield volcano         2.298851
Submarine volcano      2.298851
Pyroclastic shield     1.149425
Shield volcanoes       1.149425
Stratovolcanoes        1.149425
Unknown                1.149425
dtype: float64

In [ ]:
# 5

In [147]:
# 4
df.groupby('Country')['Region'].nunique().idxmax()

'United States'

In [ ]:
# 5